app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `perishable_token`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2010-03-06 13:22:57', '2010-03-06 13:22:57', '008eba7d22feabffe37152432941f9104b9e1e91495628a9c8468615abcf06b2c83892ff884b6214cb559fd76ab02e79bd16e9144e84684a3ab2a5a09bbf2518', '2010-03-06 13:22:57', '2fPonAWzCLYmcQeN6yxd', '127.0.0.1', '1kSoBfuUeUiAhpmXjgEr', '2010-03-06 13:22:55', '6f60a73fa30e4fab54d677132846524a540f018df190343f53268cf3639da4aecbd53dc6488ec7b803ad37ffdbfa1f851dcbfd3032b831b1ee2f21f7b7677936', 1, NULL, 'joelafferty', NULL, 'joe.m.lafferty@gmail.com')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `updated_at` = '2010-03-06 12:23:26', `crypted_password` = '35e20ff81b0d8cac7d627c91881659fd0e7b6a09baa95912decfad059477e50d2180115258c443357c49180a8e504c4ee7f00ffeaab4383b32740347ecf80c7c', `perishable_token` = 'qiHuitaHzLhpZhhhDINy', `last_login_at` = '2010-03-06 12:22:59', `current_login_at` = '2010-03-06 12:23:26', `password_salt` = '53DHchyOaGRwaCWnrLup', `login_count` = 6, `persistence_token` = 'd9857cbc91aa9fa766c4da1476e8140ee8ee89ff530c367f98f19d76889cbda70be363fdc334f62ed66578eee969042bd2ac17e81185472f8d2fc99be082f3a5', `last_request_at` = '2010-03-06 12:23:26' WHERE `id` = 5